Revit 2027 API
FailureDefinitionAccessor.GetDefaultResolutionType Method
 Retrieves the default resolution type for the failure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FailureResolutionType GetDefaultResolutionType()
Public Function GetDefaultResolutionType As FailureResolutionType
public:
FailureResolutionType GetDefaultResolutionType()
member GetDefaultResolutionType : unit -> FailureResolutionType
Return Value
FailureResolutionType
 The default resolution type for the failure.
Exceptions
Exception | Condition
InvalidOperationException |  The FailureDefinitionAccessor has not been properly initialized. -or- FailureDefinition does not have any resolutions.
See Also
Reference
FailureDefinitionAccessor Class
Autodesk.Revit.DB Namespace